export const Histories = [
	{
		company: '비상교육',
		date: '2020.09 ~ 재직중',
		explain:
			'KLaSS , ELiF, MathAlive 컨텐츠 개발 및 유지보수, OxfordDiscover 컨텐츠 개발 총괄을 진행 하였으며, 2025년 서비스 예정인 AI 디지털 교과서 개발에 참여 하였습니다.',
	},
	{
		company: '이노뎁',
		date: '2019.11 ~ 2020.08',
		explain: 'AngularJS를 이용한 타 플랫폼과의 연동',
	},
	{
		company: '클비시스템',
		date: '2017.08 ~ 2019.09',
		explain: 'Typescript 및 React 를 통한 Web application 개발',
	},
	{
		company: '디자인허브',
		date: '2016.05 ~ 2016.12',
		explain: '웹디자인',
	},
	{
		company: '홈페이지제작 오아시스',
		date: '2014.12 ~ 2016.05',
		explain:
			'웹표준 정책에 따른 HTML 코딩, 반응형 웹사이트 제작 (워드프레스, 하드코딩, 부트스트랩을 이용한 하드코딩),쇼핑몰 디자인 및 퍼블리싱 (카페24, 고도몰), 제로보드 XE 커스텀 스킨 제작',
	},
	{
		company: '㈜아이티핑거',
		date: '2013.01 ~ 2013.12',
		explain:
			'(주)아이티핑거 홈페이지 제작, 네이티브 어플리케이션을 생성해주는 웹 기반 플랫폼 제작.',
	},
	{
		company: '㈜티컴즈',
		date: '2011.08 ~ 2012.12',
		explain:
			'(주)티컴즈 웹디자인, 자회사 쓰임 브랜드 홈페이지 제작 및 상세페이지 제작',
	},
];
export const Projects = [
	{
		title: 'AI 디지털교과서1',
		date: '2023.10 ~ 2024.10',
		skills: 'JS,SASS,ROLLUP,LIT,VUE',
		account: 100,
		explain: `2025년 전국적으로 시행하는 디지털교과서의 교과서뷰어 개발, 외부 컨텐츠 개발사와의 소통 등을 담당 하였습니다. 기존 서책형 교과서를 HTML로 재 작업하는 과정에도 참여 하였고, 이를 서비스상에서 보여주는 뷰어를 작업 하였습니다. web-component 기반으로 되어 있으며, custom-event 를 이용하여 뷰어 외부와 연동하도록 제작 하였습니다.
         <br /><br />또한, 컨텐츠 제작을 위한 CMS 설계에도 참여 하였고, 이를 통해 DB스키마 분석 후 일부 API의 설계 또한 진행 하였습니다.`,
	},
	{
		title: 'AI 디지털교과서2',
		date: '2023.10 ~ 2024.10',
		skills: 'JS,SASS,ROLLUP,LIT,VUE',
		account: 100,
		explain: `2025년 전국적으로 시행하는 디지털교과서의 교과서뷰어 개발, 외부 컨텐츠 개발사와의 소통 등을 담당 하였습니다. 기존 서책형 교과서를 HTML로 재 작업하는 과정에도 참여 하였고, 이를 서비스상에서 보여주는 뷰어를 작업 하였습니다. web-component 기반으로 되어 있으며, custom-event 를 이용하여 뷰어 외부와 연동하도록 제작 하였습니다.
         <br /><br />또한, 컨텐츠 제작을 위한 CMS 설계에도 참여 하였고, 이를 통해 DB스키마 분석 후 일부 API의 설계 또한 진행 하였습니다.`,
	},
	{
		title: 'AI 디지털교과서3',
		date: '2023.10 ~ 2024.10',
		skills: 'JS,SASS,ROLLUP,LIT,VUE',
		account: 100,
		explain: `2025년 전국적으로 시행하는 디지털교과서의 교과서뷰어 개발, 외부 컨텐츠 개발사와의 소통 등을 담당 하였습니다. 기존 서책형 교과서를 HTML로 재 작업하는 과정에도 참여 하였고, 이를 서비스상에서 보여주는 뷰어를 작업 하였습니다. web-component 기반으로 되어 있으며, custom-event 를 이용하여 뷰어 외부와 연동하도록 제작 하였습니다.
         <br /><br />또한, 컨텐츠 제작을 위한 CMS 설계에도 참여 하였고, 이를 통해 DB스키마 분석 후 일부 API의 설계 또한 진행 하였습니다.`,
	},
	{
		title: 'AI 디지털교과서4',
		date: '2023.10 ~ 2024.10',
		skills: 'JS,SASS,ROLLUP,LIT,VUE',
		account: 100,
		explain: `2025년 전국적으로 시행하는 디지털교과서의 교과서뷰어 개발, 외부 컨텐츠 개발사와의 소통 등을 담당 하였습니다. 기존 서책형 교과서를 HTML로 재 작업하는 과정에도 참여 하였고, 이를 서비스상에서 보여주는 뷰어를 작업 하였습니다. web-component 기반으로 되어 있으며, custom-event 를 이용하여 뷰어 외부와 연동하도록 제작 하였습니다.
         <br /><br />또한, 컨텐츠 제작을 위한 CMS 설계에도 참여 하였고, 이를 통해 DB스키마 분석 후 일부 API의 설계 또한 진행 하였습니다.`,
	},
];
